# Pandas Operations

In [116]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','defg','ghi','xyz'], 
                  'col4' : [2,3,6,7]})
df.head()

   col1  col2  col3  col4
0     1   444   abc     2
1     2   555  defg     3
2     3   666   ghi     6
3     4   444   xyz     7

In [56]:
df

   col1  col2  col3  col4
0     1   444   abc     2
1     2   555  defg     3
2     3   666   ghi     6
3     4   444   xyz     7

In [47]:
df['col2'].unique()

array([444, 555, 666])

In [48]:
len(df['col2'].unique())

3

In [49]:
df['col2'].nunique() #better method

3

In [63]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [62]:
df.groupby('col2')[['col4']].count() #V v imp

      col4
col2
444      2
555      1
666      1

In [65]:
df[df['col1'] > 2] # equivalent of filter

   col1  col2 col3  col4
2     3   666  ghi     6
3     4   444  xyz     7

In [9]:
df['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [66]:
(df['col1'] > 2) & (df['col2'] == 444) # Note the paremntheses

0    False
1    False
2    False
3     True
dtype: bool

In [67]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3  col4
3     4   444  xyz     7

# Apply Method

In [68]:
def times2(x):
    return x * 2

In [71]:
df

   col1  col2  col3  col4
0     1   444   abc     2
1     2   555  defg     3
2     3   666   ghi     6
3     4   444   xyz     7

In [72]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [76]:
df['col1'].sum()

10

In [80]:
df['col3'].apply(len)

0    3
1    4
2    3
3    3
Name: col3, dtype: int64

In [81]:
# Lambda Recap

In [82]:
lst = [1,2,3,4]

In [83]:
map(lambda var: var ** 2, [2,3,4])

In [84]:
list(map(lambda var: var ** 2, [2,3,4]))

[4, 9, 16]

In [85]:
list(map(lambda x : x * 2, lst))

[2, 4, 6, 8]

In [86]:
# back to dataframes

In [87]:
df['col1'].apply(lambda x : x * 3)

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

In [88]:
df['col3'].apply(len)

0    3
1    4
2    3
3    3
Name: col3, dtype: int64

In [33]:
df['col2'].apply(lambda x : x * 2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [89]:
df.drop('col1', axis = 1)

   col2  col3  col4
0   444   abc     2
1   555  defg     3
2   666   ghi     6
3   444   xyz     7

In [91]:
df.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [92]:
df.index

RangeIndex(start=0, stop=4, step=1)

# Sorting and ordring a dataframe

In [117]:
df.sort_values(by ='col2', ascending = True)

   col1  col2  col3  col4
0     1   444   abc     2
3     4   444   xyz     7
1     2   555  defg     3
2     3   666   ghi     6

In [102]:
df

   col1  col2  col3  col4
0     1   444   abc     2
1     2   555  defg     3
2     3   666   ghi     6
3     4   444   xyz     7

In [114]:
df.loc[0:2, ['col1', 'col2']] = np.nan
df

   col1   col2  col3  col4
0   NaN    NaN   abc     2
1   NaN    NaN  defg     3
2   NaN    NaN   ghi     6
3   4.0  444.0   xyz     7

In [111]:
df.isnull()

    col1   col2   col3   col4
0   True   True  False  False
1   True   True  False  False
2   True   True  False  False
3  False  False  False  False

# Pivot table

In [119]:
data = {'A' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'], 
       'B' : ['one', 'one', 'two', 'two','one', 'one'],
       'C' : ['x', 'y','x', 'y','x', 'y' ], 
       'D' : [1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [121]:
df.pivot_table(values = 'D', index = ['A','B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [1]:
import pandas as pd

In [2]:
d = {'X' : ['a', 'b', 'a', 'c'], 'Y' : [1,2,3,4]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

   X  Y
0  a  1
1  b  2
2  a  3
3  c  4

In [6]:
df['X'].value_counts()

a    2
b    1
c    1
Name: X, dtype: int64